Web/HTML_and_CSS_Design_and_Build_Websites/001.Structure/001.000.Notes.org
#+title: Chapter 1: Structure
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%} .content ul:not(:first-child) {margin-top: 0.25em}}</style>

* Navigation
| Nav   | Title                                  | Links                                   |
|-------+----------------------------------------+-----------------------------------------|
| Index | Notes Home                             | \vert [[file:../../../index.html][html]] \vert [[file:../../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | HTML & CSS - Design and Build Websites | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites][github]] \vert |
| Next  | Chapter 2: Text                        | \vert [[file:../002.Text/002.000.Notes.html][html]] \vert [[file:../002.Text/002.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites/002.Text][github]] \vert |

* Notes

** Section 1.1: How the Web Works
   - When you connect to the web you do so via an Internet Service Provider (ISP)
   - When you type a URL in the browser, your browser will first connect to a Domain Name System (DNS) server
   - DNS servers act like phone books; they tell your computer the IP address associated with the requested domain name
   - IP addresses are like telephone numbers for computers (it is a way to reach and communicate computers; basically a way to identify / reach them)
   - The unique number (IP address) that was returned from the DNS server will be used by your browser to contact the web server that hosts the website you requested
   - The web server sends you the documents and resources back to the browser and your browser renders the web page

** Section 1.2: How Does HTML Describe Structure
   - First, HTML code is made up of characters that live inside angled brackets - these are called HTML elements
   - Elements are usually made up of two tags: an opening tag and a closing tag (although some HTML elements are self-closing meaning it does not need a closing tag)
   - Each HTML element tells the browser something about the information that sits between its opening and closing tags
   
   #+BEGIN_SRC html
     <html>
       <body>
         <h1>Heading</h1>
	 <p>Some paragraph</p>

	 <h2>Sub-heading</h2>
	 <p>Other paragraph</p>

	 <h2>Another sub-heading</h2>
	 <p>Another paragraph</p>
       </body>
     </html>
   #+END_SRC

   - Looking at the sample code above we see the ~<html>~ tag indicates anything between it and its closing tag is HTML code
   - The body indicates anything between its tag should be shown inside the main browser window
   - The words between ~<h1>~ are the main heading and the words between ~<h2>~ are the sub-heading
   - The text between ~<p>~ are the paragraphs
   - Notice how the document has structure with the ~<html>~ then ~<body>~ and then the headings and paragraph
   - What is the difference between element and tag? Element comprises the opening tag and closing tag and any content that lies between them
   - While a tag is simply the opening or closing tag

** Section 1.3: Attributes
   - Attributes provide additional information about the contents of an element
   - Attributes appear on the opening tag of the element and are made up of two parts: a name and a value separated by an equals sign

   #+BEGIN_SRC html
     <p lang="en-us">Paragraph in English</p>
   #+END_SRC

   - The attribute name indicates what kind of extra information you are supplying about the element's content (should be written in lowercase)
   - The value is the information or setting for the attribute (it should be placed in double quotes)
   - Different attributes can have different values
   - Majority of attributes are specific to the element but there are some that can be applied to any element like ~lang~
   - Most attribute values are either pre-defined or follow a stipulated format

** Section 1.4: Body, Head, & Title
   - The body element means everything inside this element is shown inside the main browser window
   - Before the body element you will often see a head element
   - The head element contains information about the page (rather than information that is shown within the main part of the browser)
   - You will usually find a title element inside the head element
   - The contents of the title element are either shown in the top of the browser on the title bar or on the tab of the page

** Section 1.5: HTML (HyperText Markup Language)
   - HTML stands for HyperText Markup Language
   - HyperText refers to the fact that HTML allows you to create links that allow visitors to move from one page to another quickly and easily
   - Markup language refers that it allows you to syntatically annotate text and these annotations provide additional meaning to the contents of a document (e.g. the tags we add in HTML are the markup)

** Section 1.6: Creating A Webpage
   - Let's create a webpage with a simple head and body
   - In the head it will have a title and in the body it will have a header and a paragraph
   - [[file:./001.006.Creating_A_Webpage/index.html][Here is the finished web page]]

* Keywords
| Term                               | Definition                                                                                                                                                         |
|------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| *Internet Service Provider (ISP)*  | Companies that provides customers and businesses access to the internet                                                                                            |
| *Domain Name System (DNS) Server*  | Server that acts like a phonebook; looking up the IP address of the URL (domain)                                                                                   |
| *IP Address*                       | A unique identifier (or address) that identifies a computer on the internet or local network                                                                       |
| *Uniform Resource Locator (URL)*   | A address of a unique resource on the internet or local network                                                                                                    |
| *HTML Elements*                    | Elements have (usually) two tags and the content and tell the browser how to markup the text enclosed by the tags                                                  |
| *HTML Tags*                        | A set of characters indicating the start or end of a HTML element                                                                                                  |
| *Attribute*                        | Attributes are specified in the starting tag of a HTML element and it provides additional information about the contents of an element                             |
| *HTML Body Element*                | Element that everything inside the element is shown inside the main browser                                                                                        |
| *HTML Head Element*                | Element that contains information about the page (rather than information that is shown within the main part of the browser)                                       |
| *HTML Title Element*               | Element that contains the title of the web page and displays it in the browser's title bar or on the tab of the page                                               |
| *HyperText Markup Language (HTML)* | A markup language that allows you to syntatically annotate text and these annotations provide additional meaning to the contents of a document (e.g. create links) |

* Questions
  - *Q*: What new elements were introduced with HTML5?
         - [[https://www.tutorialspoint.com/html5/html5_new_tags.htm][Tutorials Point HTML5 New Tags]] (explains the new elements introduced in HTML5)
         - Turns out a lot of new elements for article, nav, section, time, footer, header, and more
         - Many are semantic elements and we'll learn about them later

* Summary
  - The way the internet works is that your ISP (internet service provider) provides you the internet with their infrastructure (cables, servers, etc.)
  - Thus whenever you want to connect to a web page using a URL, your browser will first connect to a Domain Name System (DNS) server
  - The DNS server will act like a phonebook and look for the IP address of the URL you typed in
  - The DNS server will then send back the IP address of the URL you have typed and the browser will then send a HTTP request to the IP address
  - The web server will fulfill the request by sending back the resources and documents back to your browser and your browser will render the files into a webpage
  - It will send HTML, CSS, and JS file to your browser because those are the only things your browser understands
  - For now we are going over HTML; HTML has structure like a book, article, newspaper, etc
  - HTML has elements that provide the structure such as a head for metadata and a body to display information on the browser
  - HTML also has elements to provide headings, paragraphs, subheadings, and more just as you would see in an article or newspaper
  - HTML stands for hypertext markup language and this is because you can add links to other webpages and each element has tags to markup text; thus any text in between those tags will be markup and rendered in some way by the browser
  - Finally, each element can have attributes which are specified in the opening tag and those serve to provide additional information to the element
  - Each element has a different purpose and each attribute has a different purpose
  - There are some global attributes and specific element attributes and usually the attributes have some predefined values (it all depends on the attributes used)
